OpenNuvoton/M55M1BSP/SampleCode/StdDriver/USBD_VCOM_MultiPort/vcom_serial.c
#if (VCOM_CNT >= 4)

        if (u32IntSts & USBD_INTSTS_EP11)
        {
            /* Clear event flag */
            USBD_CLR_INT_FLAG(USBD_INTSTS_EP11);
        }

        if (u32EpIntSts & USBD_EPINTSTS_EP12)
        {
            /* Clear event flag */
            USBD_CLR_EP_INT_FLAG(USBD_EPINTSTS_EP12);
            // Bulk Out
            EP12_Handler();
        }

        if (u32EpIntSts & USBD_EPINTSTS_EP13)
        {
            /* Clear event flag */
            USBD_CLR_EP_INT_FLAG(USBD_EPINTSTS_EP13);
            // Bulk IN
            EP13_Handler();
        }

#endif

#if (VCOM_CNT >= 5)

        if (u32EpIntSts & USBD_EPINTSTS_EP14)
        {
            /* Clear event flag */
            USBD_CLR_EP_INT_FLAG(USBD_EPINTSTS_EP14);
        }

        if (u32EpIntSts & USBD_EPINTSTS_EP15)
        {
            /* Clear event flag */
            USBD_CLR_EP_INT_FLAG(USBD_EPINTSTS_EP15);
            // Bulk Out
            EP15_Handler();
        }

        if (u32EpIntSts & USBD_EPINTSTS_EP16)
        {
            /* Clear event flag */
            USBD_CLR_EP_INT_FLAG(USBD_EPINTSTS_EP16);
            // Bulk IN
            EP16_Handler();
        }

#endif

#if (VCOM_CNT >= 6)

        if (u32EpIntSts & USBD_EPINTSTS_EP17)
        {
            /* Clear event flag */
            USBD_CLR_EP_INT_FLAG(USBD_EPINTSTS_EP17);
        }

        if (u32EpIntSts & USBD_EPINTSTS_EP18)
        {
            /* Clear event flag */
            USBD_CLR_EP_INT_FLAG(USBD_EPINTSTS_EP18);
            // Bulk Out
            EP18_Handler();
        }

        if (u32EpIntSts & USBD_EPINTSTS_EP19)
        {
            /* Clear event flag */
            USBD_CLR_EP_INT_FLAG(USBD_EPINTSTS_EP19);
            // Bulk IN
            EP19_Handler();
        }

#endif

#if (VCOM_CNT >= 7)

        if (u32EpIntSts & USBD_EPINTSTS_EP20)
        {
            /* Clear event flag */
            USBD_CLR_EP_INT_FLAG(USBD_EPINTSTS_EP20);
        }

        if (u32EpIntSts & USBD_EPINTSTS_EP21)
        {
            /* Clear event flag */
            USBD_CLR_EP_INT_FLAG(USBD_EPINTSTS_EP21);
            // Bulk Out
            EP21_Handler();
        }

        if (u32EpIntSts & USBD_EPINTSTS_EP22)
        {
            /* Clear event flag */
            USBD_CLR_EP_INT_FLAG(USBD_EPINTSTS_EP22);
            // Bulk IN
            EP22_Handler();
        }

#endif
    }
}

#if (VCOM_CNT >= 1)
void EP2_Handler(void)
{
    g_u32TxSize0 = 0;
}

void EP3_Handler(void)
{
    /* Bulk OUT */
    g_u32RxSize0 = USBD_GET_PAYLOAD_LEN(EP3);
    g_pu8RxBuf0 = (uint8_t *)(USBD_BUF_BASE + USBD_GET_EP_BUF_ADDR(EP3));

    /* Set a flag to indicate bulk out ready */
    g_i8BulkOutReady0 = 1;
}
#endif

#if (VCOM_CNT >= 2)
void EP6_Handler(void)
{
    /* Bulk OUT */
    g_u32RxSize1 = USBD_GET_PAYLOAD_LEN(EP6);
    g_pu8RxBuf1 = (uint8_t *)(USBD_BUF_BASE + USBD_GET_EP_BUF_ADDR(EP6));

    /* Set a flag to indicate bulk out ready */
    g_i8BulkOutReady1 = 1;
}

void EP7_Handler(void)
{
    g_u32TxSize1 = 0;
}
#endif

#if (VCOM_CNT >= 3)
void EP9_Handler(void)
{
    /* Bulk OUT */
    g_u32RxSize2 = USBD_GET_PAYLOAD_LEN(EP9);
    g_pu8RxBuf2 = (uint8_t *)(USBD_BUF_BASE + USBD_GET_EP_BUF_ADDR(EP9));

    /* Set a flag to indicate bulk out ready */
    g_i8BulkOutReady2 = 1;
}

void EP10_Handler(void)
{
    g_u32TxSize2 = 0;
}
#endif

#if (VCOM_CNT >= 4)
void EP12_Handler(void)
{
    /* Bulk OUT */
    g_u32RxSize3 = USBD_GET_PAYLOAD_LEN(EP12);
    g_pu8RxBuf3 = (uint8_t *)(USBD_BUF_BASE + USBD_GET_EP_BUF_ADDR(EP12));

    /* Set a flag to indicate bulk out ready */
    g_i8BulkOutReady3 = 1;
}

void EP13_Handler(void)
{
    g_u32TxSize3 = 0;
}
#endif

#if (VCOM_CNT >= 5)
void EP15_Handler(void)
{
    /* Bulk OUT */
    g_u32RxSize4 = USBD_GET_PAYLOAD_LEN(EP15);
    g_pu8RxBuf4 = (uint8_t *)(USBD_BUF_BASE + USBD_GET_EP_BUF_ADDR(EP15));

    /* Set a flag to indicate bulk out ready */
    g_i8BulkOutReady4 = 1;
}

void EP16_Handler(void)
{
    g_u32TxSize4 = 0;
}
#endif

#if (VCOM_CNT >= 6)
void EP18_Handler(void)
{
    /* Bulk OUT */
    g_u32RxSize5 = USBD_GET_PAYLOAD_LEN(EP18);
    g_pu8RxBuf5 = (uint8_t *)(USBD_BUF_BASE + USBD_GET_EP_BUF_ADDR(EP18));

    /* Set a flag to indicate bulk out ready */
    g_i8BulkOutReady5 = 1;
}

void EP19_Handler(void)
{
    g_u32TxSize5 = 0;
}
#endif

#if (VCOM_CNT >= 7)
void EP21_Handler(void)
{
    /* Bulk OUT */
    g_u32RxSize6 = USBD_GET_PAYLOAD_LEN(EP21);
    g_pu8RxBuf6 = (uint8_t *)(USBD_BUF_BASE + USBD_GET_EP_BUF_ADDR(EP21));

    /* Set a flag to indicate bulk out ready */
    g_i8BulkOutReady6 = 1;
}

void EP22_Handler(void)
{
    g_u32TxSize6 = 0;
}
#endif

/*--------------------------------------------------------------------------*/
/**
  * @brief  USBD Endpoint Config.
  * @param  None.
  * @retval None.
  */
void VCOM_Init(void)
{
    /* Init setup packet buffer */
    /* Buffer for setup packet -> [0 ~ 0x7] */
    USBD->STBUFSEG = SETUP_BUF_BASE;

    /*****************************************************/
    /* EP0 ==> control IN endpoint, address 0 */
    USBD_CONFIG_EP(EP0, USBD_CFG_CSTALL | USBD_CFG_EPMODE_IN | 0);
    /* Buffer range for EP0 */
    USBD_SET_EP_BUF_ADDR(EP0, EP0_BUF_BASE);

    /* EP1 ==> control OUT endpoint, address 0 */
    USBD_CONFIG_EP(EP1, USBD_CFG_CSTALL | USBD_CFG_EPMODE_OUT | 0);
    /* Buffer range for EP1 */
    USBD_SET_EP_BUF_ADDR(EP1, EP1_BUF_BASE);

    /*****************************************************/
#if (VCOM_CNT >= 1)
    /*****************************************************/
    /* EP2 ==> Bulk IN endpoint, address 2 */
    USBD_CONFIG_EP(EP2, USBD_CFG_EPMODE_IN | BULK_IN_EP_NUM);
    /* Buffer offset for EP2 */
    USBD_SET_EP_BUF_ADDR(EP2, EP2_BUF_BASE);

    /* EP3 ==> Bulk Out endpoint, address 2 */
    USBD_CONFIG_EP(EP3, USBD_CFG_EPMODE_OUT | BULK_OUT_EP_NUM);
    /* Buffer offset for EP3 */
    USBD_SET_EP_BUF_ADDR(EP3, EP3_BUF_BASE);
    /* trigger receive OUT data */
    USBD_SET_PAYLOAD_LEN(EP3, EP3_MAX_PKT_SIZE);

    /* EP4 ==> Interrupt IN endpoint, address 1 */
    USBD_CONFIG_EP(EP4, USBD_CFG_EPMODE_IN | INT_IN_EP_NUM);
    /* Buffer offset for EP4 ->  */
    USBD_SET_EP_BUF_ADDR(EP4, EP4_BUF_BASE);
#endif

#if (VCOM_CNT >= 2)
    /*****************************************************/
    /* EP5 ==> Interrupt IN endpoint, address 3 */
    USBD_CONFIG_EP(EP5, USBD_CFG_EPMODE_IN | INT_IN_EP_NUM_1);
    /* Buffer offset for EP5 */
    USBD_SET_EP_BUF_ADDR(EP5, EP5_BUF_BASE);

    /* EP6 ==> Bulk Out endpoint, address 4 */
    USBD_CONFIG_EP(EP6, USBD_CFG_EPMODE_OUT | BULK_OUT_EP_NUM_1);
    /* Buffer offset for EP6 */
    USBD_SET_EP_BUF_ADDR(EP6, EP6_BUF_BASE);
    /* trigger receive OUT data */
    USBD_SET_PAYLOAD_LEN(EP6, EP6_MAX_PKT_SIZE);

    /* EP7 ==> Bulk IN endpoint, address 4 */
    USBD_CONFIG_EP(EP7, USBD_CFG_EPMODE_IN | BULK_IN_EP_NUM_1);
    /* Buffer offset for EP7 */
    USBD_SET_EP_BUF_ADDR(EP7, EP7_BUF_BASE);
#endif

#if (VCOM_CNT >= 3)
    /*****************************************************/
    /* EP8 ==> Interrupt IN endpoint, address 5 */
    USBD_CONFIG_EP(EP8, USBD_CFG_EPMODE_IN | INT_IN_EP_NUM_2);
    /* Buffer offset for EP8 */
    USBD_SET_EP_BUF_ADDR(EP8, EP8_BUF_BASE);

    /* EP9 ==> Bulk Out endpoint, address 6 */
    USBD_CONFIG_EP(EP9, USBD_CFG_EPMODE_OUT | BULK_OUT_EP_NUM_2);
    /* Buffer offset for EP9 */
    USBD_SET_EP_BUF_ADDR(EP9, EP9_BUF_BASE);
    /* trigger receive OUT data */
    USBD_SET_PAYLOAD_LEN(EP9, EP9_MAX_PKT_SIZE);

    /* EP10 ==> Bulk IN endpoint, address 6 */
    USBD_CONFIG_EP(EP10, USBD_CFG_EPMODE_IN | BULK_IN_EP_NUM_2);
    /* Buffer offset for EP10 */
    USBD_SET_EP_BUF_ADDR(EP10, EP10_BUF_BASE);
#endif

