OpenNuvoton/M55M1BSP/SampleCode/StdDriver/USBD_VCOM_MultiPort/vcom_serial.c
#if (VCOM_CNT >= 4)
    /*****************************************************/
    /* EP11 ==> Interrupt IN endpoint, address 7 */
    USBD_CONFIG_EP(EP11, USBD_CFG_EPMODE_IN | INT_IN_EP_NUM_3);
    /* Buffer offset for EP11 */
    USBD_SET_EP_BUF_ADDR(EP11, EP11_BUF_BASE);

    /* EP12 ==> Bulk Out endpoint, address 8 */
    USBD_CONFIG_EP(EP12, USBD_CFG_EPMODE_OUT | BULK_OUT_EP_NUM_3);
    /* Buffer offset for EP12 */
    USBD_SET_EP_BUF_ADDR(EP12, EP12_BUF_BASE);
    /* trigger receive OUT data */
    USBD_SET_PAYLOAD_LEN(EP12, EP12_MAX_PKT_SIZE);

    /* EP13 ==> Bulk IN endpoint, address 8 */
    USBD_CONFIG_EP(EP13, USBD_CFG_EPMODE_IN | BULK_IN_EP_NUM_3);
    /* Buffer offset for EP13 */
    USBD_SET_EP_BUF_ADDR(EP13, EP13_BUF_BASE);
#endif

#if (VCOM_CNT >= 5)
    /*****************************************************/
    /* EP14 ==> Interrupt IN endpoint, address 9 */
    USBD_CONFIG_EP(EP14, USBD_CFG_EPMODE_IN | INT_IN_EP_NUM_4);
    /* Buffer offset for EP14 */
    USBD_SET_EP_BUF_ADDR(EP14, EP14_BUF_BASE);

    /* EP15 ==> Bulk Out endpoint, address 10 */
    USBD_CONFIG_EP(EP15, USBD_CFG_EPMODE_OUT | BULK_OUT_EP_NUM_4);
    /* Buffer offset for EP15 */
    USBD_SET_EP_BUF_ADDR(EP15, EP15_BUF_BASE);
    /* trigger receive OUT data */
    USBD_SET_PAYLOAD_LEN(EP15, EP15_MAX_PKT_SIZE);

    /* EP16 ==> Bulk IN endpoint, address 10 */
    USBD_CONFIG_EP(EP16, USBD_CFG_EPMODE_IN | BULK_IN_EP_NUM_4);
    /* Buffer offset for EP16 */
    USBD_SET_EP_BUF_ADDR(EP16, EP16_BUF_BASE);
#endif

#if (VCOM_CNT >= 6)
    /* EP17 ==> Interrupt IN endpoint, address 11 */
    USBD_CONFIG_EP(EP17, USBD_CFG_EPMODE_IN | INT_IN_EP_NUM_5);
    /* Buffer offset for EP17 */
    USBD_SET_EP_BUF_ADDR(EP17, EP17_BUF_BASE);

    /* EP18 ==> Bulk Out endpoint, address 12 */
    USBD_CONFIG_EP(EP18, USBD_CFG_EPMODE_OUT | BULK_OUT_EP_NUM_5);
    /* Buffer offset for EP18 */
    USBD_SET_EP_BUF_ADDR(EP18, EP18_BUF_BASE);
    /* trigger receive OUT data */
    USBD_SET_PAYLOAD_LEN(EP18, EP18_MAX_PKT_SIZE);

    /* EP19 ==> Bulk IN endpoint, address 12 */
    USBD_CONFIG_EP(EP19, USBD_CFG_EPMODE_IN | BULK_IN_EP_NUM_5);
    /* Buffer offset for EP19 */
    USBD_SET_EP_BUF_ADDR(EP19, EP19_BUF_BASE);
#endif

#if (VCOM_CNT >= 7)
    /* EP20 ==> Interrupt IN endpoint, address 13 */
    USBD_CONFIG_EP(EP20, USBD_CFG_EPMODE_IN | INT_IN_EP_NUM_6);
    /* Buffer offset for EP20 */
    USBD_SET_EP_BUF_ADDR(EP20, EP20_BUF_BASE);

    /* EP21 ==> Bulk Out endpoint, address 14 */
    USBD_CONFIG_EP(EP21, USBD_CFG_EPMODE_OUT | BULK_OUT_EP_NUM_6);
    /* Buffer offset for EP21 */
    USBD_SET_EP_BUF_ADDR(EP21, EP21_BUF_BASE);
    /* trigger receive OUT data */
    USBD_SET_PAYLOAD_LEN(EP21, EP21_MAX_PKT_SIZE);

    /* EP22 ==> Bulk IN endpoint, address 14 */
    USBD_CONFIG_EP(EP22, USBD_CFG_EPMODE_IN | BULK_IN_EP_NUM_6);
    /* Buffer offset for EP22 */
    USBD_SET_EP_BUF_ADDR(EP22, EP22_BUF_BASE);
#endif
}

void VCOM_ClassRequest(void)
{
    uint8_t au8Buf[8];

    USBD_GetSetupPacket(au8Buf);

    if (au8Buf[0] & 0x80)   /* request data transfer direction */
    {
        // Device to host
        switch (au8Buf[1])
        {
            case GET_LINE_CODE:
            {
#if (VCOM_CNT >= 1)

                if (au8Buf[4] == 0)   /* VCOM-1 */
                {
                    USBD_MemCopy((uint8_t *)(USBD_BUF_BASE + USBD_GET_EP_BUF_ADDR(EP0)), (uint8_t *)&g_LineCoding0, 7);
                }

#endif

#if (VCOM_CNT >= 2)

                if (au8Buf[4] == 2)   /* VCOM-2 */
                {
                    USBD_MemCopy((uint8_t *)(USBD_BUF_BASE + USBD_GET_EP_BUF_ADDR(EP0)), (uint8_t *)&g_LineCoding1, 7);
                }

#endif

#if (VCOM_CNT >= 3)

                if (au8Buf[4] == 4)   /* VCOM-3 */
                {
                    USBD_MemCopy((uint8_t *)(USBD_BUF_BASE + USBD_GET_EP_BUF_ADDR(EP0)), (uint8_t *)&g_LineCoding2, 7);
                }

#endif

#if (VCOM_CNT >= 4)

                if (au8Buf[4] == 6)   /* VCOM-4 */
                {
                    USBD_MemCopy((uint8_t *)(USBD_BUF_BASE + USBD_GET_EP_BUF_ADDR(EP0)), (uint8_t *)&g_LineCoding3, 7);
                }

#endif

#if (VCOM_CNT >= 5)

                if (au8Buf[4] == 8)   /* VCOM-5 */
                {
                    USBD_MemCopy((uint8_t *)(USBD_BUF_BASE + USBD_GET_EP_BUF_ADDR(EP0)), (uint8_t *)&g_LineCoding4, 7);
                }

#endif

#if (VCOM_CNT >= 6)

                if (au8Buf[4] == 10)   /* VCOM-6 */
                {
                    USBD_MemCopy((uint8_t *)(USBD_BUF_BASE + USBD_GET_EP_BUF_ADDR(EP0)), (uint8_t *)&g_LineCoding5, 7);
                }

#endif

#if (VCOM_CNT >= 7)

                if (au8Buf[4] == 12)   /* VCOM-7 */
                {
                    USBD_MemCopy((uint8_t *)(USBD_BUF_BASE + USBD_GET_EP_BUF_ADDR(EP0)), (uint8_t *)&g_LineCoding6, 7);
                }

#endif
                /* Data stage */
                USBD_SET_DATA1(EP0);
                USBD_SET_PAYLOAD_LEN(EP0, 7);
                /* Status stage */
                USBD_PrepareCtrlOut(0, 0);
                break;
            }

            default:
            {
                /* Setup error, stall the device */
                USBD_SetStall(0);
                break;
            }
        }
    }
    else
    {
        // Host to device
        switch (au8Buf[1])
        {
            case SET_CONTROL_LINE_STATE:
            {
#if (VCOM_CNT >= 1)

                if (au8Buf[4] == 0)   /* VCOM-1 */
                {
                    g_u16CtrlSignal0 = au8Buf[3];
                    g_u16CtrlSignal0 = (uint16_t)(g_u16CtrlSignal0 << 8) | au8Buf[2];
                    //printf("RTS=%d  DTR=%d\n", (g_u16CtrlSignal0 >> 1) & 1, g_u16CtrlSignal0 & 1);
                }

#endif

#if (VCOM_CNT >= 2)

                if (au8Buf[4] == 2)   /* VCOM-2 */
                {
                    g_u16CtrlSignal1 = au8Buf[3];
                    g_u16CtrlSignal1 = (uint16_t)(g_u16CtrlSignal1 << 8) | au8Buf[2];
                    //printf("RTS=%d  DTR=%d\n", (g_u16CtrlSignal1 >> 1) & 1, g_u16CtrlSignal1 & 1);
                }

#endif

#if (VCOM_CNT >= 3)

                if (au8Buf[4] == 4)   /* VCOM-3 */
                {
                    g_u16CtrlSignal2 = au8Buf[3];
                    g_u16CtrlSignal2 = (uint16_t)(g_u16CtrlSignal2 << 8) | au8Buf[2];
                    //printf("RTS=%d  DTR=%d\n", (g_u16CtrlSignal1 >> 1) & 1, g_u16CtrlSignal1 & 1);
                }

#endif

