OpenNuvoton/M55M1BSP/SampleCode/StdDriver/USBD_VCOM_MultiPort/vcom_serial.c
#if (VCOM_CNT >= 4)

                if (au8Buf[4] == 6)   /* VCOM-4 */
                {
                    g_u16CtrlSignal3 = au8Buf[3];
                    g_u16CtrlSignal3 = (uint16_t)(g_u16CtrlSignal3 << 8) | au8Buf[2];
                }

#endif

#if (VCOM_CNT >= 5)

                if (au8Buf[4] == 8)   /* VCOM-5 */
                {
                    g_u16CtrlSignal4 = au8Buf[3];
                    g_u16CtrlSignal4 = (uint16_t)(g_u16CtrlSignal4 << 8) | au8Buf[2];
                }

#endif

#if (VCOM_CNT >= 6)

                if (au8Buf[4] == 10)   /* VCOM-6 */
                {
                    g_u16CtrlSignal5 = au8Buf[3];
                    g_u16CtrlSignal5 = (uint16_t)(g_u16CtrlSignal5 << 8) | au8Buf[2];
                }

#endif

#if (VCOM_CNT >= 7)

                if (au8Buf[4] == 12)   /* VCOM-7 */
                {
                    g_u16CtrlSignal6 = au8Buf[3];
                    g_u16CtrlSignal6 = (uint16_t)(g_u16CtrlSignal6 << 8) | au8Buf[2];
                }

#endif

                /* Status stage */
                USBD_SET_DATA1(EP0);
                USBD_SET_PAYLOAD_LEN(EP0, 0);
                break;
            }

            case SET_LINE_CODE:
            {
#if (VCOM_CNT >= 1)

                if (au8Buf[4] == 0) /* VCOM-1 */
                    USBD_PrepareCtrlOut((uint8_t *)&g_LineCoding0, 7);

#endif

#if (VCOM_CNT >= 2)

                if (au8Buf[4] == 2) /* VCOM-2 */
                    USBD_PrepareCtrlOut((uint8_t *)&g_LineCoding1, 7);

#endif

#if (VCOM_CNT >= 3)

                if (au8Buf[4] == 4) /* VCOM-3 */
                    USBD_PrepareCtrlOut((uint8_t *)&g_LineCoding2, 7);

#endif

#if (VCOM_CNT >= 4)

                if (au8Buf[4] == 6) /* VCOM-4 */
                    USBD_PrepareCtrlOut((uint8_t *)&g_LineCoding3, 7);

#endif

#if (VCOM_CNT >= 5)

                if (au8Buf[4] == 8) /* VCOM-5 */
                    USBD_PrepareCtrlOut((uint8_t *)&g_LineCoding4, 7);

#endif

#if (VCOM_CNT >= 6)

                if (au8Buf[4] == 10) /* VCOM-6 */
                    USBD_PrepareCtrlOut((uint8_t *)&g_LineCoding5, 7);

#endif
#if (VCOM_CNT >= 7)

                if (au8Buf[4] == 12) /* VCOM-7 */
                    USBD_PrepareCtrlOut((uint8_t *)&g_LineCoding6, 7);

#endif

                /* Status stage */
                USBD_SET_DATA1(EP0);
                USBD_SET_PAYLOAD_LEN(EP0, 0);

                break;
            }

            default:
            {
                // Stall
                /* Setup error, stall the device */
                USBD_SetStall(0);
                break;
            }
        }
    }
}

void VCOM_LineCoding(uint8_t u8Port)
{
#if (VCOM_CNT >= 1)

    if (u8Port == 0)
    {
        NVIC_DisableIRQ(DEBUG_PORT_IRQn);
        // Reset software FIFO
        g_u16ComRbytes0 = 0;
        g_u16ComRhead0 = 0;
        g_u16ComRtail0 = 0;

        g_u16ComTbytes0 = 0;
        g_u16ComThead0 = 0;
        g_u16ComTtail0 = 0;

        // Reset hardware fifo
        DEBUG_PORT->FIFO |= (UART_FIFO_RXRST_Msk | UART_FIFO_TXRST_Msk);

        UART_SetLineConfig(DEBUG_PORT,
                           (g_LineCoding0.u32DTERate),
                           (g_LineCoding0.u8DataBits - 5),
                           (g_LineCoding0.u8ParityType == 0) ? UART_PARITY_NONE :
                           (g_LineCoding0.u8ParityType == 1) ? UART_PARITY_ODD :
                           (g_LineCoding0.u8ParityType == 2) ? UART_PARITY_EVEN :
                           UART_PARITY_NONE,
                           (g_LineCoding0.u8CharFormat == 0) ? UART_STOP_BIT_1 : UART_STOP_BIT_2);

        // Re-enable UART interrupt
        NVIC_EnableIRQ(DEBUG_PORT_IRQn);
    }

#endif

#if (VCOM_CNT >= 2)
    else if (u8Port == 1)
    {
        NVIC_DisableIRQ(UART1_IRQn);
        // Reset software FIFO
        g_u16ComRbytes1 = 0;
        g_u16ComRhead1 = 0;
        g_u16ComRtail1 = 0;

        g_u16ComTbytes1 = 0;
        g_u16ComThead1 = 0;
        g_u16ComTtail1 = 0;

        // Reset hardware fifo
        UART1->FIFO |= (UART_FIFO_RXRST_Msk | UART_FIFO_TXRST_Msk);

        UART_SetLineConfig(UART1,
                           (g_LineCoding1.u32DTERate),
                           (g_LineCoding1.u8DataBits - 5),
                           (g_LineCoding1.u8ParityType == 0) ? UART_PARITY_NONE :
                           (g_LineCoding1.u8ParityType == 1) ? UART_PARITY_ODD :
                           (g_LineCoding1.u8ParityType == 2) ? UART_PARITY_EVEN :
                           UART_PARITY_NONE,
                           (g_LineCoding1.u8CharFormat == 0) ? UART_STOP_BIT_1 : UART_STOP_BIT_2);

        // Re-enable UART interrupt
        NVIC_EnableIRQ(UART1_IRQn);
    }

#endif
#if (VCOM_CNT >= 3)
    else if (u8Port == 2)
    {
        NVIC_DisableIRQ(UART2_IRQn);
        // Reset software FIFO
        g_u16ComRbytes2 = 0;
        g_u16ComRhead2 = 0;
        g_u16ComRtail2 = 0;

        g_u16ComTbytes2 = 0;
        g_u16ComThead2 = 0;
        g_u16ComTtail2 = 0;

        // Reset hardware FIFO
        UART2->FIFO = (UART_FIFO_TXRST_Msk | UART_FIFO_RXRST_Msk);

        UART_SetLineConfig(UART2,
                           (g_LineCoding2.u32DTERate),
                           (g_LineCoding2.u8DataBits - 5),
                           (g_LineCoding2.u8ParityType == 0) ? UART_PARITY_NONE :
                           (g_LineCoding2.u8ParityType == 1) ? UART_PARITY_ODD :
                           (g_LineCoding2.u8ParityType == 2) ? UART_PARITY_EVEN :
                           UART_PARITY_NONE,
                           (g_LineCoding2.u8CharFormat == 0) ? UART_STOP_BIT_1 : UART_STOP_BIT_2);

        // Re-enable UART interrupt
        NVIC_EnableIRQ(UART2_IRQn);
    }

#endif

#if (VCOM_CNT >= 4)
    else if (u8Port == 3)
    {
        NVIC_DisableIRQ(UART3_IRQn);
        // Reset software FIFO
        g_u16ComRbytes3 = 0;
        g_u16ComRhead3 = 0;
        g_u16ComRtail3 = 0;

        g_u16ComTbytes3 = 0;
        g_u16ComThead3 = 0;
        g_u16ComTtail3 = 0;

        // Reset hardware FIFO
        UART3->FIFO = (UART_FIFO_TXRST_Msk | UART_FIFO_RXRST_Msk);

