OpenNuvoton/M55M1BSP/SampleCode/StdDriver/USBD_VCOM_MultiPort/vcom_serial.c
        UART_SetLineConfig(UART3,
                           (g_LineCoding3.u32DTERate),
                           (g_LineCoding3.u8DataBits - 5),
                           (g_LineCoding3.u8ParityType == 0) ? UART_PARITY_NONE :
                           (g_LineCoding3.u8ParityType == 1) ? UART_PARITY_ODD :
                           (g_LineCoding3.u8ParityType == 2) ? UART_PARITY_EVEN :
                           UART_PARITY_NONE,
                           (g_LineCoding3.u8CharFormat == 0) ? UART_STOP_BIT_1 : UART_STOP_BIT_2);

        // Re-enable UART interrupt
        NVIC_EnableIRQ(UART3_IRQn);
    }

#endif
#if (VCOM_CNT >= 5)
    else if (u8Port == 4)
    {
        NVIC_DisableIRQ(UART4_IRQn);
        // Reset software FIFO
        g_u16ComRbytes4 = 0;
        g_u16ComRhead4 = 0;
        g_u16ComRtail4 = 0;

        g_u16ComTbytes4 = 0;
        g_u16ComThead4 = 0;
        g_u16ComTtail4 = 0;

        // Reset hardware FIFO
        UART4->FIFO = (UART_FIFO_TXRST_Msk | UART_FIFO_RXRST_Msk);

        UART_SetLineConfig(UART4,
                           (g_LineCoding4.u32DTERate),
                           (g_LineCoding4.u8DataBits - 5),
                           (g_LineCoding4.u8ParityType == 0) ? UART_PARITY_NONE :
                           (g_LineCoding4.u8ParityType == 1) ? UART_PARITY_ODD :
                           (g_LineCoding4.u8ParityType == 2) ? UART_PARITY_EVEN :
                           UART_PARITY_NONE,
                           (g_LineCoding4.u8CharFormat == 0) ? UART_STOP_BIT_1 : UART_STOP_BIT_2);

        // Re-enable UART interrupt
        NVIC_EnableIRQ(UART4_IRQn);
    }

#endif
#if (VCOM_CNT >= 6)
    else if (u8Port == 5)
    {
        NVIC_DisableIRQ(UART5_IRQn);
        // Reset software FIFO
        g_u16ComRbytes5 = 0;
        g_u16ComRhead5 = 0;
        g_u16ComRtail5 = 0;

        g_u16ComTbytes5 = 0;
        g_u16ComThead5 = 0;
        g_u16ComTtail5 = 0;

        // Reset hardware FIFO
        UART5->FIFO = (UART_FIFO_TXRST_Msk | UART_FIFO_RXRST_Msk);

        UART_SetLineConfig(UART5,
                           (g_LineCoding5.u32DTERate),
                           (g_LineCoding5.u8DataBits - 5),
                           (g_LineCoding5.u8ParityType == 0) ? UART_PARITY_NONE :
                           (g_LineCoding5.u8ParityType == 1) ? UART_PARITY_ODD :
                           (g_LineCoding5.u8ParityType == 2) ? UART_PARITY_EVEN :
                           UART_PARITY_NONE,
                           (g_LineCoding5.u8CharFormat == 0) ? UART_STOP_BIT_1 : UART_STOP_BIT_2);

        // Re-enable UART interrupt
        NVIC_EnableIRQ(UART5_IRQn);
    }

#endif

#if (VCOM_CNT >= 7)
    else if (u8Port == 6)
    {
#if (USING_UART0 == 1)
        NVIC_DisableIRQ(UART0_IRQn);
        // Reset software FIFO
        g_u16ComRbytes6 = 0;
        g_u16ComRhead6 = 0;
        g_u16ComRtail6 = 0;

        g_u16ComTbytes6 = 0;
        g_u16ComThead6 = 0;
        g_u16ComTtail6 = 0;

        // Reset hardware FIFO
        UART0->FIFO = (UART_FIFO_TXRST_Msk | UART_FIFO_RXRST_Msk);

        UART_SetLineConfig(UART0,
                           (g_LineCoding6.u32DTERate),
                           (g_LineCoding6.u8DataBits - 5),
                           (g_LineCoding6.u8ParityType == 0) ? UART_PARITY_NONE :
                           (g_LineCoding6.u8ParityType == 1) ? UART_PARITY_ODD :
                           (g_LineCoding6.u8ParityType == 2) ? UART_PARITY_EVEN :
                           UART_PARITY_NONE,
                           (g_LineCoding6.u8CharFormat == 0) ? UART_STOP_BIT_1 : UART_STOP_BIT_2);

        // Re-enable UART interrupt
        NVIC_EnableIRQ(UART0_IRQn);
#else
        NVIC_DisableIRQ(UART6_IRQn);
        // Reset software FIFO
        g_u16ComRbytes6 = 0;
        g_u16ComRhead6 = 0;
        g_u16ComRtail6 = 0;

        g_u16ComTbytes6 = 0;
        g_u16ComThead6 = 0;
        g_u16ComTtail6 = 0;

        // Reset hardware FIFO
        UART6->FIFO = (UART_FIFO_TXRST_Msk | UART_FIFO_RXRST_Msk);

        UART_SetLineConfig(UART6,
                           (g_LineCoding6.u32DTERate),
                           (g_LineCoding6.u8DataBits - 5),
                           (g_LineCoding6.u8ParityType == 0) ? UART_PARITY_NONE :
                           (g_LineCoding6.u8ParityType == 1) ? UART_PARITY_ODD :
                           (g_LineCoding6.u8ParityType == 2) ? UART_PARITY_EVEN :
                           UART_PARITY_NONE,
                           (g_LineCoding6.u8CharFormat == 0) ? UART_STOP_BIT_1 : UART_STOP_BIT_2);

        // Re-enable UART interrupt
        NVIC_EnableIRQ(UART6_IRQn);
#endif

    }

#endif
}
